tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "microsoft/git"

brew "coreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion@2"

# Productivity tools
brew "fx"
brew "fzf"
brew "git"
brew "jq"
brew "mas"
brew "yq"
brew "lolcat"

# Node
brew "fnm"

# Shell tools
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Github CLI
brew "gh"

# Casks
cask "figma"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "brave-browser"
cask "visual-studio-code"
cask "bettertouchtool"
cask "iterm2"
cask "discord"

# Mac App Store
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899
mas "Vimari", id: 1480933944
