tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "microsoft/git"

brew "coreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion@2"

# Productivity tools
brew "fx"
brew "fzf"
brew "git"
brew "jq"
brew "mas"
brew "yq"

# Node
brew "fnm"

# Shell tools
# brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# VS code
brew install --cask vscodium

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Casks
cask "confluent-cli"
cask "firefox-developer-edition"
cask "figma"
cask "git-credential-manager-core"
cask "intellij-idea"
cask "karabiner-elements"
cask "kitty"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"

# Mac App Store
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899