# Taps (Homebrew 6: third-party taps must be explicitly trusted)
tap "anomalyco/tap", trusted: true
tap "buo/cask-upgrade", trusted: true
tap "homebrew/brew-vulns"

# Productivity tools
brew "cloc"
brew "coreutils"
brew "findutils"
brew "fx"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "homebrew/brew-vulns/brew-vulns"
brew "jq"
brew "mas"
brew "rtk"
brew "yq"
brew "lolcat"

# Languages & runtimes
brew "asdf"
brew "bun"
brew "fnm"
brew "go"
brew "pnpm"
brew "uv"

# Containers
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# Security tools (skill dependencies)
brew "agent-browser"
brew "bats-core"
brew "gitleaks"
brew "grype"
brew "jadx"
brew "pandoc"
brew "poppler"
brew "trivy"
brew "trufflehog"

# Shell tools
brew "bash"
brew "bash-completion@2"
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Github CLI
brew "gh"

# AI tools
brew "anomalyco/tap/opencode"

# Casks
cask "figma"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "arc"
cask "ghostty"
cask "1password"
cask "cursor"
cask "appcleaner"
cask "codex"
cask "gcloud-cli"
cask "opencode-desktop"
cask "t3-code"
cask "visual-studio-code"
cask "supacode"
# Claude Code is installed via the native installer in setup-mac.sh
# (curl -fsSL https://claude.ai/install.sh | bash) — the cask breaks auto-updates.

# Mac App Store
mas "Xcode", id: 497799835
mas "Jojo", id: 1659864300
